from frozendict import frozendict

poem_types = \
    frozendict(
        {
            "01": "Любовная лирика",
            "02": "Пейзажная лирика",
            "04": "Циклы стихов",
            "05": "Прозаические миниатюры",
            "06": "Афоризмы",
            "08": "Городская лирика",
            "10": "Стихи для детей",
            "11": "Шуточные стихи",
            "12": "Пародии",
            "13": "Мистика и изотерика",
            "14": "Гражданская лирика",
            "15": "Белый и вольный стих",
            "16": "Ироничиские стихи",
            "17": "Философская лирика",
            "18": "Восток: рубаи, хокку, танка",
            "19": "Религиозная лирика",
            "20": "Поэтические переводы",
            "21": "Подражания",
            "22": "запад: сонеды, канцоны, рондо",
            "23": "Авторская песня",
            "24": "Эстрадная песня",
            "25": "Русский рок",
            "26": "Либретто",
            "32": "Верлибр",
            "33": "Переделки песен",
            "34": "Сатирические стихи",
            "36": "Стихи на других языках",
            "37": "Шансон",
            "39": "Стихотворения в прозе",
            "40": "Эссе и статьи",
            "41": "Басни",
            "43": "Переводы песен",
            "44": "Акростихи",
            "46": "Поэмы",
            "47": "Пьесы",
            "50": "Детское творчество",

        }
    )